const fs = require("fs-extra");
const dayjs = require("dayjs");

let gens = 50;

while (gens--) {
    fs.writeFileSync(`./src/posts/article${gens}.md`, `---
title: 测试页面 ${gens}
thumbnail: test.png
date: ${dayjs().format("YYYY-MM-DD HH:mm:ss")}
category: 测试
---

这里是测试页面 ${gens} 的摘录，支持 \`markdown\` 

<!-- excerpt -->

普通文字

{% cq "text" output %}

# 一级标题
## 二级标题
### 三级标题
#### 四级标题
##### 五级标题
###### 六级标题

- [ ] 未选中
- [x] 选中

长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长——

文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文文——

字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字——

*斜体*、**粗体**、***加粗斜体***、~~删除线~~

在一个段落中的[文字链接](https://xecades.xyz)

* 无序列表项一
+ 无序列表项二
- 无序列表项三

1. 有序列表项一
2. 有序列表项二
3. 有序列表项三

---

---

图片前的段落

![图片测试](http://www.lenna.org/len_std.jpg)

>>> 三级引用，长长长长长长长长长长长长长长长长长长长长长长文文文文文文文文文文文文文文文文文文文文文文字字字字字字字字字字字字字字字字字字字字字字
>>
>> 二级引用，长长长长长长长长长长长长长长长长长长长长长长文文文文文文文文文文文文文文文文文文文文文文字字字字字字字字字字字字字字字字字字字字字字
>
> 一级引用，长长长长长长长长长长长长长长长长长长长长长长文文文文文文文文文文文文文文文文文文文文文文字字字字字字字字字字字字字字字字字字字字字字

> 很多个引用很多个引用很多个引用很多个引用
> 
> 很多个引用很多个引用很多个引用很多个引用
> 
> 很多个引用很多个引用很多个引用很多个引用

小型嵌入 html 片段

<img src="data:image/svg+xml,<svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 8 8' width='8px' height='8px'><circle cx='4' cy='4' r='4' opacity='.5'/></svg>"/>

行内代码块："\`scanf()\` 是输入函数。"

\`\`\`cpp
#include <stdio.h>

int main()
{
    printf("Hello world\\n");
    return 0;
}
\`\`\`
    `, "utf-8");
}
